---
title: "debug"
published: true
---

# Linux C/C++代码调试
## 前言

https://github.com/SimpleSoft-2020/book_debug.git

## 第1章　C/C++调试基本知识

### 1.1　BUG与Debug

发现问题的根源比想出解决方案更重要。找到问题的根源是一种技能，也更有价值。

### 1.2　为什么选择C/C++

本书主要介绍如何调试C/C++代码，如果掌握了本书的调试方法与技巧，其他语言的调试也能够驾轻就熟。

如果掌握了VC软件的调试方法与技巧，就可以轻松地迁移到Dev-C上进行调试，甚至能够平滑地迁移到Eclipse中调试Java代码—尽管界面有所不同，但是软件调试的核心是相同的。

## 第3章　Linux系统gdb调试基本功能

### 3.1　Linux C/C++编程基本知识

无论在哪里编写代码，最后都要到Linux系统中编译、调试和运行。

#### 3.1.1　开发环境安装

在Linux系统中开发C/C++程序时，我们用到的工具一般是gcc和g++。gcc和g++既有区别，又有联系，下面进行简单介绍。

GCC（GNU Compiler Collection）即GNU编译工具集，有编译器、链接器、组装器等，主要用来编译C和C++语言，也可以编译Objective-C和Objective-C++程序。注意，这里的GCC是大写的，代表的是GNU编译工具集。

而gcc（GNU C Compiler）（注意，这里是小写的）代表的是GNU C语言编译器；g++代表的是GNU C++语言编译器。但是从本质上讲，gcc和g++并不是真正的编译器，它们也只是GCC里面的两个工具，在编译C/C++程序时，它们会调用真正的编译器对代码进行编译。可以简单地这样理解：gcc工作的时候会调用C编译器；g++工作的时候会调用C++编译器。二者的部分区别如下。

**·文件后缀名的处理方式不同：**gcc会将后缀为.c的文件当作C程序，将后缀为.cpp的文件当作C++程序；g++会将后缀为.c和.cpp的都当成C++程序。因为C和C++语法上有一些区别，所以有时候通过g++编译的程序不一定能通过gcc编译。要注意的是，gcc和g++都可以用来编译C和C++代码。

**·链接方式不同：**gcc不会自动链接C++库（比如STL标准库），g++会自动链接C++库。

**·预处理器宏不同：**g++会自动添加一些预处理器宏，比如__cplusplus，但是gcc不会。所以，如果要开发纯C语言的程序，可以使用gcc；如果要开发C/C++程序，而且还要使用STL标准库。为了开发的便利性，建议使用g++。

**1.CentOS上安装gcc和g++**

```
yum -y install gcc gcc-c++
```

```
gcc -v
```

```
g++ -v
```

**2.在Ubuntu上安装gcc和g++**

```
apt-get -y install gcc g++
```

#### 3.1.2　开发第一个C/C++程序

**1.使用C语言编写HelloWorld程序**

helloworld.c

```c
#include <stdio.h>

int main() {
  printf("hello, world\n");
  return 0;
}

```

```

(gdb) catch throw
Catchpoint 1 (throw)
(gdb) catch catch
Catchpoint 2 (catch)
(gdb) i b
Num     Type           Disp Enb Address            What
1       breakpoint     keep y   0x00007ffff788a310 exception throw
	breakpoint already hit 1 time
2       breakpoint     keep y   0x00007ffff78891f0 exception catch
	breakpoint already hit 1 time
```

捕获点也是一种特殊的断点，因此可以使用管理断点的命令来管理捕获点，比如使用i b命令来查看所有断点，包括捕获点。

```
(gdb) r
Starting program: /root/book_debug/chapter_3.3/chapter_3.3 
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib64/libthread_db.so.1".
name is test_try_catch,10
throw

Catchpoint 1 (exception thrown), __cxxabiv1::__cxa_throw (obj=0x41aca0, tinfo=0x407d20 <typeinfo for int@@CXXABI_1.3>, dest=0x0) at /usr/src/debug/gcc-9.1.0/libstdc++-v3/libsupc++/eh_throw.cc:80
80	  __cxa_eh_globals *globals = __cxa_get_globals ();
(gdb) bt
#0  __cxxabiv1::__cxa_throw (obj=0x41aca0, tinfo=0x407d20 <typeinfo for int@@CXXABI_1.3>, dest=0x0) at /usr/src/debug/gcc-9.1.0/libstdc++-v3/libsupc++/eh_throw.cc:80
#1  0x0000000000401977 in test_try_catch (number=10) at chapter_3.3.cpp:200
#2  0x00000000004019d3 in main (argc=1, argv=0x7fffffffe0e8) at chapter_3.3.cpp:214
(gdb) f 1
#1  0x0000000000401977 in test_try_catch (number=10) at chapter_3.3.cpp:200
200	                throw 10;
(gdb) i locals
throw_num = 50
local_data = 10
name = 0x40420c "test_try_catch"
(gdb) c
Continuing.

Catchpoint 2 (exception caught), __cxxabiv1::__cxa_begin_catch (exc_obj_in=0x41ac80) at /usr/src/debug/gcc-9.1.0/libstdc++-v3/libsupc++/eh_catch.cc:42
42	  _Unwind_Exception *exceptionObject
(gdb) bt
#0  __cxxabiv1::__cxa_begin_catch (exc_obj_in=0x41ac80) at /usr/src/debug/gcc-9.1.0/libstdc++-v3/libsupc++/eh_catch.cc:42
#1  0x000000000040197f in test_try_catch (number=10) at chapter_3.3.cpp:202
#2  0x00000000004019d3 in main (argc=1, argv=0x7fffffffe0e8) at chapter_3.3.cpp:214
(gdb) f 1
#1  0x000000000040197f in test_try_catch (number=10) at chapter_3.3.cpp:202
202	        catch(...)
(gdb) i locals
local_data = 10
name = 0x40420c "test_try_catch"
```

命令catch还有一个对应的命令tcatch，意思是临时捕获，即只捕获一次，命中后会自动删除该捕获点（与临时断点类似）。

#### 3.14.3　搜索源代码

```
search 正则表达式
forward-search 正则表达式
```

```
(gdb) search member
17	int member_id = 0;
(gdb) 
18	void add_member()
(gdb) 
36		new_node->ID = member_id++;
(gdb) 
252				add_member();
(gdb) 
Expression not found
```

```
reverse-search 正则表达式
```

```
(gdb) reverse-search member
36		new_node->ID = member_id++;
(gdb) 
18	void add_member()
(gdb) 
17	int member_id = 0;
(gdb) 
Expression not found
```

#### 3.14.4　查看变量类型

可以使用命令ptype来查看变量或者结构体以及类等详细信息。语法如下：

```
ptype 可选参数 变量或者类型
```

其中，可选参数用来控制显示信息，变量或者类型可以是任意的变量，也可以是定义的数据类型，比如类、结构体、枚举等。

其中的可选参数如下所示。

·/r：表示以原始数据的方式显示，不会代替一些typedef定义。

·/m：查看类时，不显示类的方法，只显示成员变量。

·/M：与/m相反，显示类的方法（默认选项）。

·/t：不打印类中的typedef数据。

·/o：打印结构体字段的偏移量和大小。

```
(gdb) ptype node_head
type = struct NODE {
    int ID;
    char Name[40];
    int age;
    NODE *prev;
    NODE *next;
} *
(gdb) ptype /o node_head
type = struct NODE {
/*    0      |     4 */    int ID;
/*    4      |    40 */    char Name[40];
/*   44      |     4 */    int age;
/*   48      |     8 */    NODE *prev;
/*   56      |     8 */    NODE *next;

                           /* total size (bytes):   64 */
                         } *
(gdb) ptype TEST_NODE
type = struct TEST_NODE {
    char gender[3];
    int ID;
    char name[7];
}
(gdb) ptype /o TEST_NODE
/* offset    |  size */  type = struct TEST_NODE {
/*    0      |     3 */    char gender[3];
/* XXX  1-byte hole */
/*    4      |     4 */    int ID;
/*    8      |     7 */    char name[7];
/* XXX  1-byte padding */

                           /* total size (bytes):   16 */
                         }
```

```
(gdb) ptype test_1
type = class test_1 {
  private:
    int x;
    int y;

  public:
    test_1(void);
    ~test_1();
    virtual void test_fun(void);
}
(gdb) ptype test_2
type = class test_2 : public test_1 {
  public:
    test_2(void);
    ~test_2();
    virtual void test_fun2(void);
    virtual void test_fun(void);
}
```

```
(gdb) ptype /o test_1
/* offset    |  size */  type = class test_1 {
                         private:
/*    8      |     4 */    int x;
/*   12      |     4 */    int y;

                           /* total size (bytes):   16 */
                         }
(gdb) p sizeof(test_1)
$1 = 16
(gdb) p sizeof(void*)
$2 = 8
```

还有一个简单的命令whatis用来查看变量或者表达式的类型，只是打印的信息比较简单

```
(gdb) whatis number
type = int
(gdb) whatis name
type = const char *
(gdb) whatis call_fun_test_1
type = int (int, const char *)
(gdb) ptype call_fun_test_1
type = int (int, const char *)
```

#### 3.14.5　跳转执行

在调试过程中，很多时候我们希望某些代码能够被反复执行，因为我们希望能够多次查看问题，以便更加仔细地观察问题。有时候又希望直接跳过某些代码，比如环境的问题、不能满足某些条件、部分代码没有意义或者会执行失败等。

这就是跳转执行，即不按照代码的流程逐行执行，而是按照我们期望的方式执行。命令语法如下：

```
jump 位置
```

命令中的位置可以是代码行或者某个函数的地址。

```
(gdb) b 42
(gdb) r
(gdb) b 36
Breakpoint 2 at 0x4013b0: file chapter_3.3.cpp, line 36.
(gdb) jump 36
Continuing at 0x4013b0.

Thread 1 "chapter_3.3" hit Breakpoint 2, add_member () at chapter_3.3.cpp:36
36		new_node->ID = member_id++;
```

如果想跳过某些代码行，直接进入到某一行或者某个函数去执行，仍然可以使用jump命令去完成。

```
jump add_member
```

```
(gdb) b add_member
(gdb) r
(gdb) C-c
